final.org
#+TITLE: Teoremas para el final de matemática discreta II 2024
#+AUTHOR: Tomás Maraschio
#+STARTUP: latexpreview
#+STARTUP: overview
#+OPTIONS: toc:nil
#+OPTIONS: num:1
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LANGUAGE: es
\newpage\tableofcontents

* ¿Cuál es la complejidad de Edmonds-Karp?
Para esta demostración usaré las definiciones y resultados de [[id:distancias][_este teorema_]].
*La complejidad de EK es $O(n \times m^2)$*. EK encuentra un camino aumentante de s a t y aumenta el flujo a lo largo de este, esto lo hace hasta que no encuentra más caminos aumentantes. Por lo tanto, su complejidad viene dada por:
\[(Compl(\text{\small aumentar flujo}) + Compl(\text{\small encontrar camino aumentante})) \times \# \text{\small caminos aumentantes} \]
La complejidad de aumentar el flujo en un camino es O(n), pues el camino tiene a lo sumo n vértices y tengo que recorrerlo dos veces. La complejidad de encontrar un camino aumentante es O(m) porque uso BFS. Luego, como ${n \le m}$ (en componentes conexas al menos):
\[Compl(EK) = O(m) \times \# \text{caminos aumentantes} \]
Entonces me basta probar que hay $O(m \times n)$ caminos aumentantes. Para ello veré cuántas veces puede un lado volverse crítico, teniendo en cuenta que un lado se vuelve crítico en el paso k cuando para pasar al paso k+1 este se satura o vacía completamente. Esto lo hago porque por cada camino aumentante que encuentre, cuando aumente el flujo, voy a saturar o llenar al menos un lado en ese camino. Entonces si puedo acotar la cantidad de veces que un lado se vuelve crítico, habré acotado la cantidad de caminos aumentantes.
Entonces veré los diferentes casos en donde se satura un lado.

** El lado \(\overrightarrow{xz}\) se satura en el paso k
Esto significa que para pasar de $f_k$ a $f_{k+1}$ usé un \(f_k\)-camino aumentante de la forma \(s \cdots x z \cdots t\). Como estoy corriendo EK, este camino es el de menor longitud entre s y t, lo que implica que también es el de menor longitud entre s y x y z, entonces
\[ d_k(z) = d_k(x) + 1 \]
Ahora voy a ver qué pasa cuando $\overrightarrow{xz}$ vuelve a hacerse crítico en un paso j. Esto puede ocurrir por dos razones:
- Si se usa backward en j y se vacía.
- Si en un paso i entre k y j se usa backward y se vacía un poco, para luego en j usarse forward y saturarse.
De todas formas, \(\exists i : k < i \le j \) tal que $\overrightarrow{xz}$ se usa backward en el paso i. Esto significa que para pasar de \(f_i\) a \(f_{i+1}\) uso un \(f_i\)-camino aumentante de la forma ${s \cdots \overleftarrow{zx} \cdots t}$, y por la misma razón que antes tengo que
\[d_i(x) = d_i(z) + 1\]
Juntando todo llego a
\begin{align*}
d_j(t) & \ge d_i(t) \\
       & = d_i(x) + b_i(x) \\
       & = d_i(z) + 1 + b_i(x) \\
       & \ge d_k(z) + 1 + b_k(x) \\
       & = d_k(x) + 1 + 1 + b_k(x) \\
       & = d_k(t) + 2
\end{align*}

** El lado \(\overrightarrow{xz}\) se vacía en el paso k
Esto significa que para pasar de $f_k$ a $f_{k+1}$ usé un \(f_k\)-camino aumentante de la forma \(s \cdots \overleftarrow{zx} \cdots t\). Como estoy corriendo EK, este camino es el de menor longitud entre s y t, lo que implica que 
\[ d_k(x) = d_k(z) + 1 \]
Ahora voy a ver qué pasa cuando $\overrightarrow{xz}$ vuelve a hacerse crítico en un paso j. Esto puede ocurrir por dos razones:
- Si se usa forward en j y se satura.
- Si en un paso i entre k y j se usa forward y se llena un poco, para luego en j usarse backward y vaciarse.
De todas formas, \(\exists i : k < i \le j \) tal que $\overrightarrow{xz}$ se usa forward en el paso i. Esto significa que para pasar de \(f_i\) a \(f_{i+1}\) uso un \(f_i\)-camino aumentante de la forma ${s \cdots x z \cdots t}$, y por la misma razón que antes tengo que
\[d_i(z) = d_i(x) + 1\]
Juntando todo llego a
\begin{align*}
d_j(t) & \ge d_i(t) \\
       & = d_i(z) + b_i(z) \\
       & = d_i(x) + 1 + b_i(z) \\
       & \ge d_k(x) + 1 + b_k(z) \\
       & = d_k(z) + 1 + 1 + b_k(z) \\
       & = d_k(t) + 2
\end{align*}
** Conclusión
En ambos casos llego a que si un lado se vuelve crítico, para que pueda volver a hacerlo la distancia entre s y t debe aumentar en al menos 2. Y como esta distancia está siempre entre 1 y n-1, esto puede pasar a lo sumo n/2 = O(n) veces. Como es para cada lado, tengo que en toda la corrida de EK, un lado cualquiera se vuelve crítico $O(n \times m)$ veces, lo que significa que tengo $O(n \times m)$ caminos aumentantes.


* Probar que ${d_k(x) \le d_{k+1}(x)}$
:PROPERTIES:
:ID: distancias
:END:
** Definiciones
Primero, recuerdo las definiciones. Para un flujo f y vértices x,z:
\begin{align*}
d_f(x, z) =
  \begin{cases}
    0 & \text{si } x = z \\
    \infty & \text{si no existe f-camino aumentante entre x y z} \\
    & \text{longitud del menor f-camino aumentante entre x y z}
  \end{cases}
\end{align*}
A partir de esta puedo definir para ${f_0, f_1, f_2, \cdots}$ la sucesión de flujos producidos por Edmonds-Karp:
\begin{align*}
d_k(x) = d_{f_k}(s, x) \\
b_k(x) = d_{f_k}(x, t) 
\end{align*}
Y además ${d_k(t) = d_k(x) + b_k(x)}$, si esos números son finitos.

** Primera parte
Sea el conjunto \[ A = \{x \in V : d_{k+1}(x) < d_k(x)\}, \] si pruebo que este conjunto es vacío ya está.
Sup. que A no es vacío, entonces tomo ${x \in A}$ tal que ${ d_{k+1}(x) = min\{d_{k+1}(y) : y \in A\}. }$
Además tengo que
\[ d_{k+1}(x) < d_k(x) \le \infty \implies d_{k+1}(x) < \infty, \tag{0}\]
lo que significa que existe un \(f_{k+1}\)-camino aumentante entre s y x. Y además como
\[d_{k+1}(s) = d_k(s) = 0 \implies s \not\in A \implies x \ne s,\]
sé que x tiene un elemento anterior en ese camino, el cual denotaré
\[ p_{k+1} : s \cdots z x \]
Ahora, como estoy usando E-K, ese camino es el de menor longitud entre s y x, lo que significa que también es el de menor longitud entre s y cualquier vértice anterior a x, porque si no podría encontrar un camino aún más corto a x. Entonces
\[ d_{k+1}(x) = d_{k+1}(z) + 1 \tag{1}\]
Luego, como ${d_{k+1}(z) < d_{k+1}(x)}$ y x es el elemento de A con menor $d_{k+1}$, sé que ${z \not\in A}$, lo que implica que
\[ d_k(z) \le d_{k+1}(z) \tag{2} \]
Juntando 0, 1 y 2 llego a ${d_k(z) < \infty}$, lo que significa que existe un \(f_k\)-camino aumentante de longitud mínima entre s y z de la forma ${p_k: s \cdots z}$.

** Si $\overrightarrow{zx}$ es un lado
En principio podría agregar x al final de $p_k$ para obtener un \(f_k\)-camino aumentante entre s y x. Pero si hago eso llego a
\[ d_k(x) \le d_k(z)+1 \le d_{k+1}(z) + 1 = d_{k+1}(x), \]
lo que es un absurdo porque x está en A. Este absurdo tiene que venir de que no puedo agregar x al camino, y esto tiene que ser porque ${f_k(\overrightarrow{zx}) = c(\overrightarrow{zx})}$. Pero en $p_{k+1}$ está el lado $\overrightarrow{zx}$, lo que significa que para pasar de $f_k$ a $f_{k+1}$ tuve que usarlo en modo backward. Es decir, existe un camino de longitud mínima (por usar E-K)
\[ p_k': s \cdots \overleftarrow{xz} \cdots t, \]
entonces ${d_k(z) = d_k(x) + 1}$. Luego,
\begin{align*}
d_k(z) & = d_k(x) + 1 \\
       & > d_{k+1}(x) + 1 \\
       & = d_{k+1}(z) + 2 \\
       & \ge d_k(z) + 2
\end{align*}
Absurdo pues 0 < 2.

** Si $\overrightarrow{xz}$ es un lado
En principio podría agregar x al final de $p_k$ para obtener un \(f_k\)-camino aumentante entre s y x. Pero si hago eso llego a
\[ d_k(x) \le d_k(z)+1 \le d_{k+1}(z) + 1 = d_{k+1}(x), \]
lo que es un absurdo porque x está en A. Este absurdo tiene que venir de que no puedo agregar x al camino, y esto tiene que ser porque ${f_k(\overrightarrow{zx}) = 0}$. Pero en $p_{k+1}$ está el lado $\overleftarrow{zx}$, lo que significa que para pasar de $f_k$ a $f_{k+1}$ tuve que usarlo en modo forward. Es decir, existe un camino de longitud mínima (por usar E-K)
\[ p_k': s \cdots xz \cdots t, \]
entonces ${d_k(z) = d_k(x) + 1}$. Luego,
\begin{align*}
d_k(z) & = d_k(x) + 1 \\
       & > d_{k+1}(x) + 1 \\
       & = d_{k+1}(z) + 2 \\
       & \ge d_k(z) + 2
\end{align*}
Absurdo pues 0 < 2.

