final.tex
\subsection*{Valor de todo flujo menor o igual a capacidad de todo corte}
\label{sec:org42800cb}
\[
f(\overline{S}, S) = \sum_{\substack{x \not\in S \\ y \in S \\ \overrightarrow{xy} \in E}} f(\overrightarrow{xy}) \ge 0 \text{ pues } f(\overrightarrow{xy}) \ge 0, \forall \overrightarrow{xy} \in E
\]
Entonces tengo \(V(f) = f(S, \overline{S}) - f(\overline{S}, S) \le f(S, \overline{S}) \le c(S, \overline{S}) = Cap(S)\)

\subsection*{\(\impliedby\) vuelta}
\label{sec:orge13ac7a}
Sea f flujo y S corte con \(V(f) = Cap(S)\). Para todo flujo g, por lo que probé arriba tengo \(V(g) \le Cap(S) = V(f) \implies\) f es maximal. Además, para todo corte T tengo \(Cap(T) \ge V(f) = Cap(S) \implies\) S es minimal.

\subsection*{\(\implies\) ida}
\label{sec:org94decf5}
Sea f flujo maximal. Voy a construir un S y probaré que es un corte minimal con V(f) = Cap(S).
\[ S = \{s\} \cup \{x \colon \text{existe f-camino aumentante de s a x}\} \]
\subsubsection*{S es corte}
\label{sec:org2ff6d51}
Sup. que no lo es. La única forma que pase esto es porque \(t \not\in S\), pues \(s \in S\). Pero esto significa que existe un f-camino aumentante de s a t, por lo que puedo aumentar f en ese camino. Absurdo porque f es maximal, luego S es corte.

\subsubsection*{V(f) = Cap(S)}
\label{sec:org3199c86}
Sean \(x \in S, y \not\in S, \overrightarrow{xy} \in E\).
\[ x \in S \implies \text{ existe f-camino aumentante de s a x} \]
\[ y \not\in S \implies \text{ no existe f-camino aumentante de s a y} \]
Entonces el camino \(s \cdots x y\) podría ser aumentante, pero no lo es, y esto solo puede ser si \(f(\overrightarrow{xy})=c(\overrightarrow{xy})\). Entonces
\[f(S, \overline{S}) = \sum_{\substack{x \in S \\ y \not\in S \\ \overrightarrow{xy} \in E}} f(\overrightarrow{xy}) = \sum_{\substack{x \in S \\ y \not\in S \\ \overrightarrow{xy} \in E}} c(\overrightarrow{xy}) = c(S, \overline{S}) = Cap(S) \]


Ahora sean \(x \not\in S, y \in S, \overrightarrow{xy} \in E\).
\[ x \not\in S \implies \text{ no existe f-camino aumentante de s a x} \]
\[ y \in S \implies \text{ existe f-camino aumentante de s a y} \]
Entonces el camino \(s \cdots \overleftarrow{yx}\) podría ser aumentante, pero no lo es, y esto solo puede ser si \(f(\overrightarrow{xy})=0\). Entonces
\[f(\overline{S}, S) = \sum_{\substack{x \not\in S \\ y \in S \\ \overrightarrow{xy} \in E}} f(\overrightarrow{xy}) = \sum_{\substack{x \not\in S \\ y \in S \\ \overrightarrow{xy} \in E}} 0 = 0\]

Finalmente: \(V(f) = f(S, \overline{S}) - f(\overline{S}, S) = Cap(S) - 0 = Cap(S)\)


\section{Probar que si G es un grafo conexo no regular entonces \(\chi(G) \le \Delta(G)\)}
\label{sec:orgc4c43d9}
Sea \(x\) tal que \(d(x) = \delta(G)\). Corro BFS empezando por \(x\) y guardo el orden inverso en que los vértices se visitaron. Ahora voy a correr greedy en este orden que acabo de guardar. Notar que en BFS todo vértice es incluido por un vértice que ya ha sido visitado, entonces en el orden inverso todo vértice tiene al menos un vecino por delante (excepto el x). Esto significa que para cada vértice \(y\), en el peor caso va a tener \(d(y)-1 < \Delta\) vecinos coloreados todos con un color distinto, entonces voy a poder elegir un color en \(\{1,\cdots, \Delta\}\). Finalmente, cuando llego a x, como \(d(x)=\delta<\Delta\), podré elegir algún color de \(\{1,\cdots, \Delta\}\) que no está usado por ningún vecino de x para colorearlo. De esta forma tengo un coloreo propio de G que usa (a lo sumo) \(\Delta\) colores, entonces \(\chi(G) \le \Delta(G)\).



\section{Probar que 2-COLOR es polinomial}
\label{sec:orgd77d4df}
Para ello voy a dar un algoritmo polinomial que colorea un grafo con dos colores. Luego probaré que si el coloreo que da mi algoritmo no es propio es porque en el grafo hay algún ciclo impar, lo que implicaría \(\chi(G) \ge 3\). Notar que voy a asumir que el grafo es conexo, sin embargo si no lo es, simplemente hay que correr el algoritmo en todas sus componentes conexas y ver que todas sean bipartitas.

\subsection*{Algoritmo}
\label{sec:orgf52796b}
Agarro un vértice x de G y corro BFS empezando en él. Luego a cada vértice y le asigno el color \(Nivel_{BFS}(y) \text{ mod 2}\). Esto es lo mismo que pintar a x del color 1, y luego cada vez que un vértice z agrega a un vértice y en BFS, asigno \(c(y) = 1 - c(z)\). Es claro que esta parte es O(m) por usar BFS.

Ahora tengo que revisar que el coloreo sea en efecto propio, lo que cuesta \({\displaystyle\sum_{x \in V} O(d(x)) = O(m)}\). Entonces llego a que mi algoritmo es polinomial.
\subsection*{¿Qué pasa cuando el coloreo que di no es propio?}
\label{sec:org6c81210}
Eso significa que \(\exists u,v \in V : c(u) = c(v) \land uv \in E\). Entonces
\begin{align*}
Nivel_{BFS}(u) \text{ mod 2} = Nivel_{BFS}(v) \text{ mod 2} \\
\implies Nivel_{BFS}(u) + Nivel_{BFS}(v) \text{ es par} \tag{1}
\end{align*}
Como u y v fueron agregados por un BFS desde x, sé que existe un camino de x a u y un camino de x a v. Ahora sea w el vértice tal que estos dos caminos se separan (notar que w puede ser x), voy a calcular la cantidad de lados en el ciclo \({w \cdots u v \cdots w}\).
\begin{itemize}
\item En \(w \cdots u\) hay \(Nivel_{BFS}(u) - Nivel_{BFS}(w)\) lados.
\item En \(uv\) hay 1 lado.
\item En \(v \cdots w\) hay \(Nivel_{BFS}(v) - Nivel_{BFS}(w)\) lados.
\end{itemize}
Luego en el ciclo hay
\begin{align*}
Nivel_{BFS}(u) - Nivel_{BFS}(w) + 1 + Nivel_{BFS}(v) - Nivel_{BFS}(w) \\
= Nivel_{BFS}(u) + Nivel_{BFS}(v) + 2 \times Nivel_{BFS}(w) + 1
\end{align*}
lados, que es un número impar por (1).


\section{Enunciar y probar el teorema de Hall}
\label{sec:org5ff0212}
El teorema de Hall dice que en un grafo bipartito con partes X e Y, existe un matching completo de X a Y si y solo si \({|\Gamma(S)| \ge |S|, \forall S \subseteq X}\). Notar que un matching M de X a Y es completo si |E(M)| = |X|.

\subsection*{\(\implies\) ida}
\label{sec:org836f2f9}
Sea M un matching completo de X a Y. Este me induce una función inyectiva \[f: X \rightarrow Y\] tal que \[f(x) \in \Gamma(x).\] Luego, como f es inyectiva, tengo que \[|f(S)| = |S|, \forall S \subseteq X.\]
Y además \[f(S) \subseteq \Gamma(S).\]
Finalmente, tengo que \(|S| \le |\Gamma(S)|, \forall S \subseteq X\).
