final.org
** $\impliedby$ vuelta
Sup. que se cumple ${|\Gamma(S)| \ge |S|, \forall S \subseteq X}$ (condición de Hall), pero que al correr el algoritmo de encontrar matching maximal llego a un M con ${|E(M)| < |X|.}$
Trabajaré sobre la forma matricial del algoritmo.
Sean
\begin{align*}
S & = \{\text{\small filas etiquetadas}\} \\
T & = \{\text{\small columnas etiquetadas}\} \\
S_0 & = \{\text{\small filas etiquetadas con }\star\} \\
T_1 & = \{\text{\small columnas etiquetadas por }S_0\} \\
S_1 & = \{\text{\small filas etiquetadas por } T_1\}
\end{align*}
Y en general:
\begin{align*}
T_{i+1} & = \{\text{\small columnas etiquetadas por }S_i\} \\
S_i & = \{\text{\small filas etiquetadas por } T_i\}.
\end{align*}
Notar que como M no es completo, tengo algunas filas sin matchear, es decir que
\[S_0 \ne \emptyset \tag{0}\]
Además, es claro que
\begin{align*}
S & = S_0 \dot\cup S_1 \dot\cup S_2 \dot\cup \cdots \tag{1a} \\
T & = T_1 \dot\cup T_2 \dot\cup T_3 \dot\cup \cdots \tag{1b}
\end{align*}
Ahora, cuando estoy viendo una columna pueden pasar dos cosas:
- La columna está libre, entonces la matcheo y extiendo el matching. Esto no pasa porque M es maximal.
- La columna está matcheada con una fila, entonces etiqueto _únicamente_ esa fila.
Así, es claro que
\[|T_i| = |S_i| \tag{2}\]
y que el algoritmo se detiene al pasar de un \(S_k\) a un ${T_{k+1} = \emptyset}$. Entonces llego a que
\begin{align*}
S & = S_0 \dot\cup \cdots \dot\cup S_k \\
T & = T_1 \dot\cup \cdots \dot\cup T_k 
\end{align*}
Juntando todo:
\begin{align*}
|S| & = |S_0| + |S_1| + \cdots + |S_k| \quad\text{por 1a} \\
    & = |S_0| + |T_1| + \cdots + |T_k| \quad\text{por 2} \\
    & = |S_0| + |T| \quad\text{por 1b} \\
    & > |T| \quad\text{por 0}
\end{align*}
Ahora voy a ver que $T = \Gamma(S)$:
- $T \subseteq \Gamma(S)$: sea $y \in T$, $y$ tuvo que ser etiquetado por una fila de S, y como cada fila etiqueta a sus columnas vecinas es claro que ${y \in \Gamma(S).}$
- $\Gamma(S) \subseteq T$: sup. que existe un $y \in \Gamma(S)$ que no está en T. Existe un ${x \in S}$ que es vecino de $y$. Pero cuando revisé $x$, habría visto que $y$ era vecino suyo, y por lo tanto lo habría etiquetado. Absurdo pues supuse ${y \not\in T}$, luego, ${\Gamma(S) \subseteq T.}$

Finalmente, construí un $S \subseteq X$ tal que no se cumple la condición de Hall. Lo que es un absurdo pues yo supuse que era cierta. Entonces este absurdo viene de suponer que el matching maximal no es completo.


* Enunciar y probar el teorema del matrimonio de Koenig
Este teorema dice que todo grafo bipartito regular tiene un matchig perfecto. Un matching es perfecto si es completo en ambos sentidos.

Defino
\[ E_W = \{wu \in E : w \in W\} \quad\text{ para } W \subseteq V \]
Sean X e Y las partes del grafo. Sea $S \subseteq X$ y \(l \in E_S.\) Entonces existen ${x \in S}$ y ${y \in Y}$ tales que \({l = xy}.\) Entonces ${y \in \Gamma(x) \subseteq \Gamma(S),}$ por lo que \({l \in E_{\Gamma(S)}.}\) Finalmente llego a
\[ E_S \subseteq E_{\Gamma(S)} \implies |E_S| \le |E_{\Gamma(S)}|, \forall S \subseteq X \]

Ahora calcularé cuanto vale ${|E_W|}$ para \({W \subseteq X}\) o \({W \subseteq Y.}\) Sea ${wu \in E_W}$, es claro que ${u \not\in W,}$ pues ${w \in X}$ o \({w \in Y},\) entonces
\[ E_W = \dot\bigcup_{w \in W} \{wu : u \in \Gamma(w)\} \]
Entonces
\begin{align*}
|E_W| & = \sum_{w \in W} |\{ wu : u \in \Gamma(w) \}| \\
      & = \sum_{w \in W} d(w) \\
      & = \sum_{w \in W} \Delta \quad\text{pues el grafo es regular} \\
      & = |W| \times \Delta
\end{align*}
Luego
\begin{align*}
|E_S| \le |E_\Gamma(S)| & \Leftrightarrow |S| \times \Delta \le |\Gamma(S)| \times \Delta \\
                        & \Leftrightarrow |S| \le |\Gamma(S)|
\end{align*}

Así, por teorema de Hall, sé que hay matching completo de X a Y. Pero la elección de X sobre Y en esta demostración fue arbitraria, por lo que la podría repetir para un ${S \subseteq Y}$ y llegar a que hay un matching completo de Y a X. Esto significa que ${|X| \le |Y|}$ y ${|X| \ge |Y|}$, por lo que ${|X| = |Y|,}$ entonces el matching es perfecto.


* Enunciar y probar el teorema de la cota de Hamming

** Teorema
Para todo código $C \in \{0, 1\}^n$ con $t = \lfloor \frac{\delta-1}{2} \rfloor$:
                    \[ |C| \le \frac{2^n}{1 + n + \binom{n}{2} + \cdots + \binom{n}{t}} \]
** Demostración
Sea
          \[ A = \bigcup_{v \in C} D_t(v) \]
buscaré $|A|$.

Como $C$ corrige t errores, tengo que
      \[ D_t(v) \cap D_t(w) = \emptyset, \forall v,w \in C \text{ tales que } v \ne w \]
Luego, es claro que A es unión disjunta.

Ahora, defino
      \[ S_r(v) = \{ w \in C : d_H(v, w) = r \} \]
De esta forma es claro que
      \[ D_t(v) = \bigcup_{r = 0}^t S_r(v) \quad\text{unión disjunta}\]

Sea $w \in S_r(v)$, hay un subconjunto de los n bits de las palabras que tiene r elementos tal que $w$ difiere de $v$ en esos r bits. Con esto en mente:
- Dado $w \in S_r(v)$, puedo obtener r bits en los que $v$ y $w$ difieren.
- Dado un conjunto de r bits, puedo obtener un $w$ tal que ${ d_H(v, w) = r. }$
Así, existe una biyección entre $S_r(v)$ y el conjunto de subconjuntos de r bits. Entonces la cardinalidad de estos conjuntos es la misma. Finalmente:
      \[ |S_r(v)| = \binom{n}{r} \implies |D_t(v)| = \sum_{r=0}^t \binom{n}{r} \]

Juntando todo tengo:
      \begin{align*}
        |A| & = \sum_{v \in C} |D_t(v)| \\
            & = \sum_{v \in C} \sum_{r=0}^t \binom{n}{r} \\
            & = |C| \times \sum_{r=0}^t \binom{n}{r} \\
            & \le 2^n \quad\text{pues } A \subseteq \{0, 1\}^n \\
            & \implies \\
      |C| & \le \frac{2^n}{\displaystyle\sum_{r=0}^t \binom{n}{r}}
      \end{align*}


* Probar que si ${C = Nu(H)}$, entonces ${\delta(C)}$ = tamaño del mínimo conjunto de columnas de H que es LD
Sean ${m = \min\{j : \exists \text{ conjunto LD de j columnas de H}\}}$ y ${\delta = \delta(C).}$

** $m \le \delta$
Como C es lineal,
      \[ \delta = \min\{|x| : x \in C \land x \ne 0  \} \]
Sea $x$ tal que ${|x| = \delta.}$ ${\exists i_1, \cdots i_{\delta} }$ tales que $x$ tiene un 1 en esas posiciones y un 0 en las demás. Entonces tengo que
      \[ x = e_{i_1} + \cdots + e_{i_\delta} \]
Además, como ${x \in C = Nu(H)}$, ${H \cdot x^T = 0.}$

Luego,
\begin{align*}
	0 & = H \cdot x^T \\
    & = H \cdot (e_{i_1} + \cdots + e_{i_\delta})^T \\
    & = H \cdot (e_{i_1}^T + \cdots + e_{i_\delta}^T) \\
    & = H \cdot e_{i_1}^T + \cdots + H \cdot e_{i_\delta}^T) \\
    & = H^{(i_1)} + \cdots + H^{(i_\delta)}
\end{align*}

Entonces, como existe un subconjunto de $\delta$ columnas que es LD, ${m \le \delta.}$

** ${\delta \le m}$
Por como definí $m$, sé que hay un conjunto de $m$ columnas que es LD. Sean ${H^{(j_1)}, \cdots, H^{(j_m)}}$ esas columnas. Luego, sea ${x = e_{j_1} + \cdots + e_{j_m}.}$
\begin{align*}
	H \cdot x^T & = H \cdot (e_{j_1} + \cdots + e_{j_m})^T \\
              & = H \cdot (e_{j_1}^T + \cdots + e_{j_m}^T) \\
              & = H \cdot e_{j_1}^T + \cdots + H \cdot e_{j_m}^T \\
              & = H^{(j_1)} + \cdots + H^{(j_m)} \\
              & = 0
\end{align*}

Entonces ${ x \in Nu(H) = C, }$ y como ${x \ne 0,}$ tengo que ${\delta \le |x| = m. }$


* Sea un código C de longitud n, dimensión k y polinomio generador g(x), probar que:
1.  ${C = \{p(x) : gr(p) < n \land g(x) | p(x) \} = C_1}$
2.  ${C = \{v(x) \odot g(x) : v(x) \text{ es un polinomio cualquiera} \} = C_2}$
3. ${ gr(g) = n - k }$
4. ${ g(x) | (1+x^n) }$

** 1 y 2
Para probar esto, probaré que ${ C_1 \subseteq C_2 \subseteq C \subseteq C_1. }$

