final.org
*** _$C_1 \subseteq C_2$_
Sea $p(x) \in C_1$, entonces existe $q(x)$ tal que ${p(x) = g(x) \cdot q(x).}$ Además
      \[ n > gr(p) = gr(g(x) \cdot q(x)) \]
Entonces es claro que
      \[ p(x) = g(x) \cdot q(x) = g(x) \odot q(x) \in C_2 \]

*** _$C_2 \subseteq C$_
Sea ${ p(x) = v(x) \odot g(x) \in C_2, }$ con $v(x)$ un polinomio cualquiera de la forma
      \[ v(x) = v_0 + v_1 \cdot x + v_2 \cdot x^2 + \cdots + v_{gr(v)} \cdot x^{gr(v)} \]
Entonces:
\begin{align*}
p(x) & = v(x) \odot g(x) \\
     & = (v_0 + v_1 \cdot x + v_2 \cdot x^2 + \cdots + v_{gr(v)} \cdot x^{gr(v)}) \odot g(x) \\
     & = v_0 \odot g(x) + v_1 \cdot (x \odot g(x)) + v_2 \cdot (x^2 \odot g(x)) + \cdots + v_{gr(v)} \cdot (x^{gr(v)} \odot g(x)) \\
     & = v_0 \cdot g(x) + v_1 \cdot Rot(g(x)) + v_2 \cdot Rot^2(g(x)) + \cdots + v_{gr(v)} \cdot Rot^{gr(v)}(g(x)) \\
     & \in C
\end{align*}
Pues todas las rotaciones de $g(x)$ están en $C$.

*** _$C \subseteq C_1$_
Sea \(p(x) \in C,\) es claro que ${gr(p) < n,}$ falta ver que ${g(x) | p(x). }$ Entonces voy a dividir $p$ por $g$:
      \[ \exists q(x),r(x) : p(x) = g(x) \cdot q(x) + r(x) \land gr(r) < gr(g) \]

Ahora tomo módulo:
\begin{align*}
	p(x) & = p(x) \text{ mod } (1 + x^n) \\
	     & = (g(x) \cdot q(x) + r(x)) \text{ mod } (1 + x^n) \\
       & = g(x) \odot q(x) + (r(x) \text{ mod } (1 + x^n)) \\
       & = g(x) \odot q(x) + r(x) \quad\text{pues } gr(r) < gr(g) < n
\end{align*}
Entonces tengo que
      \[ r(x) = p(x) + g(x) \odot q(x) \]
Y como $p \in C$ y ${g(x) \odot q(x) \in C_2 \subseteq C,}$ entonces ${ r \in C.}$ Pero como $g$, es el generador, este es el único polinomio no nulo de menor grado en ${C,}$ y como ${gr(r)<gr(g),}$ entonces ${r(x) = 0.}$

Finalmente, como $g(x) | p(x)$, ${p(x) \in C_1.}$

** 3
Sea $p(x) \in C$, entonces existe $q(x)$ tal que ${ p(x) = g(x) \cdot q(x) .}$ Además ${n > gr(p) = gr(g) + gr(q) }$, entonces ${ gr(q) < n - gr(g) .}$
Ahora, sea un $q(x)$ tal que $gr(q) < n - gr(g)$, tengo que ${ g(x) \cdot q(x) \in C. }$

Es decir, hay una biyección entre $C$ y el conjunto de polinomios de grado menor a ${n - gr(g).}$ Entonces:
\begin{align*}
	|C| & = |\text{conjunto de polinomios de grado menor a } n - gr(g)| \\
      \iff & \\
  2^k & = 2^{n - gr(g)} \\
      \iff & \\
    k & = n - gr(g) \\
      \iff & \\
    gr(g) & = n - k \\
\end{align*}

** 4
Divido $1+x^n$ por $g(x)$:
      \[ \exists q(x), r(x) : 1 + x^n = g(x) \cdot q(x) + r(x) \land gr(r) < gr(g) \]
Ahora, si tomo módulo:
\begin{align*}
	0 & = (1 + x^n) \text{ mod } (1 + x^n) \\
    & = g(x) \cdot q(x) + r(x) \text{ mod } (1 + x^n) \\
    & = g(x) \odot q(x) + (r(x) \text{ mod } (1 + x^n)) \\
    & = g(x) \odot q(x) + r(x) \quad\text{pues } gr(r) < gr(g) < n \\
\implies \\
r(x) & = g(x) \odot q(x) \in C
\end{align*}
Pero como $g$, es el polinomio de $C$ no nulo de menor grado y ${gr(r) < gr(g),}$ entonces ${r(x) = 0}$ y ${g(x) | (1 + x^n).}$


* Probar que 3SAT es NP-completo
Como sé que SAT es NP-completo, probaré que SAT \(\le_P\) 3SAT. Primero tengo que dar un algoritmo polinomial que transforme instancias de SAT en instancias de 3SAT.

** El algoritmo
Sea $B$ una expresión booleana con variables ${ x_1, \cdots, x_i }$ tal que
      \[ B = D_1 \land \cdots \land D_m \]
Donde cada $D_j$ es una disyunción de literales ${l_{j1}, \cdots, l_{jr_j}.}$ Entonces voy a transformar a cada $D_j$ en un $E_j$ que será una conjunción de disjunciones de 3 literales:
*** _Si $r_j = 1$_:
Introduzco las variables $y_{j1}, y_{j2}$:
    \[E_j = (l_{j1} \lor y_{j1} \lor y_{j2}) \land (l_{j1} \lor \overline{y_{j1}} \lor y_{j2}) \land (l_{j1} \lor y_{j1} \lor \overline{y_{j2}}) \land (l_{j1} \lor \overline{y_{j1}} \lor \overline{y_{j2}}) \]

*** _Si $r_j = 2$_:
Introduzco $y_j$:
      \[E_j = (l_{j1} \lor l_{j2} \lor y_j) \land (l_{j1} \lor l_{j2} \lor \overline{y_j}) \]

*** _Si $r_j = 3$_:
Entonces es claro que $E_j = D_j$.

*** _Si $r_j \ge 4$_:
Voy a introducir las variables ${ y_{j1}, \cdots, y_{j(r_j - 3)}$:
\begin{align*}
	E_j & = (l_{j1} \lor l_{j2} \lor y_{j1}) \\
      & \land (\overline{y_{j1}} \lor y_{j2} \lor l_{j3}) \\
      & \land (\overline{y_{j2}} \lor y_{j3} \lor l_{j4}) \\
      & \land \cdots \\
      & \land (\overline{y_{j(r_j-4)}} \lor y_{j(r_j-3)} \lor l_{j(r_j-2)}) \\
      & \land (\overline{y_{j(r_j-3)}} \lor l_{j(r_j-1)} \lor l_{jr_j}) 
\end{align*}

Es claro que este algoritmo es polinomial, porque si B tiene k literales, agrego a lo sumo k literales más (en realidad es menos que esto).

** Los D son satisfacibles sii los E lo son
Ahora que puedo transformar mi problema SAT en 3SAT, falta ver que mi B original es satisfacible si y solo si el nuevo lo es. Y como B es una conjunción de disjunciones, esto es lo mismo que ver que cada $D_j$ es satisfacible $\iff$ $E_j$ lo es. Esto es lo mismo que ver que
      \[ D_j(\overrightarrow{b}) = 1 \iff \exists \overrightarrow{d} : E_j(\overrightarrow{b}, \overrightarrow{d}) = 1 \]
donde $\overrightarrow{b}$ es el vector de asignación de las variables $x$, mientras que $\overrightarrow{d}$ es el de las $y$.

Es trivial ver que esto se cumple para los $D_j$ donde $r_j \le 3$. Me quedan los otros casos.

*** _$\implies$ ida_
Sup. que $D_j$ es satisfacible. Es decir, existe un vector de bits $\overrightarrow{b}$ tal que $D_j(\overrightarrow{b}) = 1$. Como $D_j$ es una disyunción, hay un $l_{jk}$ tal que ${l_{jk}(\overrightarrow{b}) = 1.}$ Tomo tal $l_{jk}$ que cumpla eso (si hay más de uno, tomo el primero) y defino $\overrightarrow{d}$:
      \[ d_1, \cdots, d_{k-2} = 1 \quad\text{y} \quad d_{k-1}, \cdots, d_{r_j - 3} = 0 \]

Ahora si evalúo $E_j$, teniendo en cuenta que ${y_{ji}(\overrightarrow{d}) = d_i}$ y ${\overline{y_{ji}(\overrightarrow{d})} = 1 - d_i}$:
\begin{align*}
	E_j(\overrightarrow{b}, \overrightarrow{d}) & = (l_{j1} \lor l_{j2} \lor y_{j1})(\overrightarrow{b}, \overrightarrow{d}) \quad("=1" \text{ pues } d_1 = 1)\\
      & \land (\overline{y_{j1}} \lor y_{j2} \lor l_{j3})(\overrightarrow{b}, \overrightarrow{d}) \quad("=1" \text{ pues } d_2 = 1) \\
      & \land \cdots \\
      & \land (\overline{y_{j(k-3)}} \lor y_{j(k-2)} \lor l_{j(k-1)})(\overrightarrow{b}, \overrightarrow{d}) \quad("=1" \text{ pues } d_{k-2} = 1) \\
      & \land (\overline{y_{j(k-2)}} \lor y_{j(k-1)} \lor l_{jk})(\overrightarrow{b}, \overrightarrow{d}) \quad("=1" \text{ pues } l_{jk}(\overrightarrow{b}) = 1) \\
      & \land (\overline{y_{j(k-1)}} \lor y_{jk} \lor l_{j(k+1)})(\overrightarrow{b}, \overrightarrow{d}) \quad("=1" \text{ pues } d_{k-1} = 0) \\
      & \land \cdots \\
      & \land (\overline{y_{j(r_j-3)}} \lor l_{j(r_j-1)} \lor l_{jr_j})(\overrightarrow{b}, \overrightarrow{d}) \quad("=1" \text{ pues } d_{r_j-3} = 0) \\
      & = 1
\end{align*}


*** _$\impliedby$ vuelta_
Sup. que tengo  $\overrightarrow{b}$ y $\overrightarrow{d}$ tales que $E_j(\overrightarrow{b}, \overrightarrow{d}) = 1$.  Ahora sup. que $D_j(\overrightarrow{b}) = 0$. Esto implica que todas las $l_{jq}$ se evalúan a 0 con $\overrightarrow{b}$, y como $E_j(\overrightarrow{b}, \overrightarrow{d}) = 1$ esto implica que 
\begin{align*}
	1 & = (y_{j1} \\
    & \land (\overline{y_{j1}} \lor y_{j2}) \\
    & \cdots \\
    & \land (\overline{y_{j(r_j-4)}} \lor y_{j(r_j-3)}) \\
    & \land \overline{y_{j(r_j-3)}}) (\overrightarrow{d})
\end{align*}
lo cual es claramente un absurdo. Luego, $D_j(\overrightarrow{b}) = 1$.


* Probar que 3COLOR es NP-completo
Para ello probaré que 3SAT \(\le\) 3COLOR.

