final.tex

\subsection*{Algoritmo}
\label{sec:orgb6cc982}
Voy a crear un grafo G a partir de una expresión booleana \({B = D_1 \land \cdots \land D_m}\) con variables \(x_1, \cdots, x_i\), donde \(D_j = l_{j1} \lor l_{j2} \lor l_{j3}\).

\subsubsection*{Vértices}
\label{sec:orgb742329}
\begin{align*}
V(G) = & \{u_1, \cdots, u_i, w_1, \cdots, w_i\} \\
     \cup & \{a_{j1}, a_{j2}, a_{j3}\}_{j=1,\cdots,m} \\
     \cup & \{e_{j1}, e_{j2}, e_{j3}\}_{j=1,\cdots,m} \\
     \cup & \{CAPI, t\}
\end{align*}

\subsubsection*{Lados}
\label{sec:org6ecfddc}

\begin{itemize}
\item \underline{Triángulos}
\label{sec:org7d80ae7}
\[ \{u_it, tw_i, w_iu_i\}_{i=1,\cdots,n} \]

\item \underline{Garras}
\label{sec:orga9b14fa}
\[ \{a_{j1}a_{j2}, a_{j2}a_{j3}, a_{j3}a_{j1}\}_{j=1,\cdots,m} \cup \{a_{j1}e_{j1}, a_{j2}e_{j2}, a_{j3}e_{j3}\}_{j=1,\cdots,m} \]

\item \underline{Lados}
\label{sec:orgc585329}
\[\{(CAPI)e_{jr}\}_\substack{j=1,\cdots,m & r=1,2,3} \]

\item \underline{Lados}
\label{sec:org877aec4}
\[ \{(CAPI)t\}\]

\item \underline{Lados}
\label{sec:org74562f0}

Para estos voy a definir
\begin{align*}
v(l_{jr}) =
  \begin{cases}
    u_q & \text{si } \exists q : l_{jr} = x_q \\
    w_q & \text{si } \exists q : l_{jr} = \overline{x_q}
  \end{cases}
\end{align*}
Y luego los lados serán
\[ \{e_{jr}(v(l_{jr}))\}_\substack{j=1,\cdots,m & r=1,2,3} \]
\end{itemize}


\subsection*{B satisfacible sii \(\chi(G) \le 3\)}
\label{sec:org34ad62f}
\subsubsection*{\underline{\(\impliedby\) vuelta}}
\label{sec:orge4dae29}
Sup. \(\chi(G) \le 3\), como en G hay triángulos entonces \(\chi(G) = 3\). Sea C un coloreo propio de G que usa 3 colores, como \((CAPI)t\) es un lado, tengo que los colores posibles son \({\{C(CAPI), C(t), Z\}}\).
Ahora defino el vector de bits \(\overrightarrow{b}\):
\begin{align*}
b_i = 
\begin{cases}
  1 & \quad\text{si } C(u_i) = C(CAPI) \\
  0 & \quad\text{si } C(u_i) \ne C(CAPI)
\end{cases}	
\end{align*}

Para probar que \(B(\overrightarrow{b})\) tengo que ver que \({\forall j, \exists r : l_{jr}(\overrightarrow{b}) = 1.}\) Sea \({j \in \{1,\cdots,m\}}\). Como los \(a_{jr}\) forman un triángulo, hay un \(r\) tal que \(C(a_{jr}) = C(t)\).
\begin{align*}
	e_{jr}a_{jr} \in E(G) & \implies C(e_{jr}) \ne C(a_{jr}) = C(t) \\
	e_{jr}(CAPI) \in E(G) & \implies C(e_{jr}) \ne C(CAPI)
\end{align*}

Lo que implica que \(C(e_{jr}) = Z\). Ahora
\begin{align*}
	e_{jr}v(l_{jr}) \in E(G) & \implies C(v(l_{jr})) \ne C(e_{jr}) = Z \\
	tv(l_{jr}) \in E(G) & \implies C(v(l_{jr})) \ne C(t)
\end{align*}

Entonces tengo que \(C(v(l_{jr})) = C(CAPI)\).

\begin{itemize}
\item \uline{Si \(v(l_{jr})\) es una variable}
\end{itemize}

Existe k tal que \(l_{jr} = x_k\). Entonces \(v(l_{jr}) = u_k\), y por lo tanto \(C(u_k) = C(CAPI)\). Por cómo definí \(\overrightarrow{b}\), tengo que \(b_k = 1\), entonces
      \[ l_{jr}(\overrightarrow{b}) = x_k(\overrightarrow{b}) = b_k = 1 \]

\begin{itemize}
\item \uline{Si \(v(l_{jr})\) es una negación de variable}
\end{itemize}

Existe k tal que \(l_{jr} = \overline{x_k}\). Entonces \(v(l_{jr}) = w_k\), y por lo tanto \(C(w_k) = C(CAPI)\). Como \(u_kw_k\) es un lado, tengo que \(C(u_k) \ne C(CAPI)\), entonces \(b_k = 0\). Finalmente
      \[ l_{jr}(\overrightarrow{b}) = \overline{x_k(\overrightarrow{b})} = 1 - b_k = 1 \]

Finalmente, como para cualquier j existe un r tal que \(l_{jr}(\overrightarrow{b}) = 1\), tengo que \(B(\overrightarrow{b}) = 1\).

\subsubsection*{\underline{\(\implies\) ida}}
\label{sec:org2e15e41}
Sup. que \(B(\overrightarrow{b})=1\), voy a dar un coloreo C con 3 colores y probaré que es propio en G. Primero, defino que \({C(CAPI) = ROJO}\) y \({C(t) = VERDE}\), por lo que es claro que no hay problema con el lado \(t(CAPI)\). Para los \(u\) y los \(w\) defino:
\begin{align*}
	C(u_i) = \begin{cases}
  	ROJO & \quad\text{si } b_i = 1 \\
  	NEGRO & \quad\text{si } b_i = 0 \\
  \end{cases}
  \quad
	C(w_i) = \begin{cases}
  	NEGRO & \quad\text{si } b_i = 1 \\
  	ROJO & \quad\text{si } b_i = 0 \\
  \end{cases}
\end{align*}

Entonces los triángulos formados por \(u_i, w_i, t\) no tienen problema ya que están pintados de (NEGRO, ROJO, VERDE) en algún orden.

Ahora tengo que ver cómo pintar los \(a\). Como \(B(\overrightarrow{b}) = 1\), sé que
      \[ \forall j, \exists k_j : l_{jk_j}(\overrightarrow{b})=1 \]
Entonces tomo ese \(k_j\) para cada \(j\) (si hay más de uno, tomo el más chico). Luego, para cada \(j \in \{1, \cdots, m\}\) defino:
      \[ C(a_{jk_j}) = VERDE \quad\text{y pinto los otros dos uno de ROJO y otro de NEGRO}\]
De esta forma, los triángulos de \(a\) no tienen problema.

Ahora, para pintar los \(e\):
      \[ C(e_{jk_j}) = NEGRO \quad C(e_{jr}) = VERDE \text{ para } r \ne k_j \]

Falta ver que los lados con \(e\) no tengan problema.
\begin{itemize}
\item \(e_{jk_j}a_{jk_j}\)

No genera problema pues \({C(e_{jk_j}) = NEGRO \ne VERDE = C(a_{jk_j})}\)

\item \(e_{jr}a_{jr}\) con \(r \ne k_j\)

No hay problema pues \({C(e_{jr}) = VERDE}\) y \({C(a_{jr}) = ROJO \text{ o } NEGRO}\)

\item \(e_{jr}CAPI\)

No hay problema pues \(C(e_{jr}) = NEGRO \text{ o } VERDE\) y \({C(CAPI) = ROJO}\)

\item \(e_{jr}v(l_{jr})\) con \(r \ne k_j\)

No hay problema pues \({C(e_{jr}) = VERDE}\) y \({C(v(l_{jr})) = ROJO \text{ o } NEGRO}\) porque \({v(l_{jr}) = u_i \text{ o } w_i}\) para algún i

\item \(e_{jk_j}v(l_{jk_j})\)

\begin{itemize}
\item Si \(l_{jk_j}\) es una variable

Entonces existe q tal que \({l_{jk_j} = x_q}\). Entonces
      \[1 = l_{jk_j}(\overrightarrow{b}) = x_q(\overrightarrow{b}) = b_q \]
Por lo que \({C(v(l_{jk_j})) = C(u_q) = ROJO}\), entonces no hay problema.

\item Si \(l_{jk_j}\) es una negación de una variable

Entonces existe q tal que \({l_{jk_j} = \overline{x_q}}\). Entonces
      \[1 = l_{jk_j}(\overrightarrow{b}) = \overline{x_q}(\overrightarrow{b}) = 1 - b_q \implies b_q = 0 \]
Por lo que \({C(v(l_{jk_j})) = C(w_q) = ROJO}\), entonces no hay problema.
\end{itemize}
\end{itemize}


\section{Probar que matrimonio trisexual es NP-completo}
\label{sec:orgb15ca89}
Para ello voy a probar que 3SAT \(\le_P\) MATRIMONIO-trisexual, entonces voy a dar un algoritmo para pasar de una instancia a otra.

\subsection*{El algoritmo}
\label{sec:orgea97b71}
Sea B una instancia de 3SAT con variables \(x_1, \cdots, x_n\) tal que \({B = D_1 \land \cdots \land D_m}\) con \(D_j = l_{j1} \lor l_{j2} \lor l_{j3}\). Voy a construir un 3-hipergrafo \(H\) con partes \(X\), \(Y\) y \(Z\). Para simplificar la notación usaré:
\begin{align*}
i & \in \{1, \cdots, n\} \\
j & \in \{1, \cdots, m\} \\
r & \in \{1, 2, 3\} \\
k & \in \{1, \cdots, m(n-1)\} \\
\end{align*}

\subsubsection*{Vértices}
\label{sec:org5661198}
\begin{align*}
	X & = \{a_{ij}\}_{i,j} \cup \{s_j\}_j \cup \{h_k\}_k \\
	Y & = \{b_{ij}\}_{i,j} \cup \{t_j\}_j \cup \{g_k\}_k \\
	Z & = \{u_{ij}, w_{ij}\}_{i,j}
\end{align*}

Un requisito para que haya matching perfecto es que \(|X| = |Y| = |Z|\), lo cual se cumple pues
\begin{align*}
	|X| & = nm + m + m(n-1) = 2nm \\
	|Y| & = nm + m + m(n-1) = 2nm \\
	|Z| & = nm + nm = 2nm
\end{align*}

\subsubsection*{Lados}
\label{sec:orge13a5e6}
Primero, defino
\[
v_{jr} = \begin{cases}
          u_{ij} & \quad\text{si } \exists i : l_{jr} = x_i \\	
          w_{ij} & \quad\text{si } \exists i : l_{jr} = \overline{x_i}
\end{cases}
\]
Luego, los lados del hipergrafo H serán \(E_0 \cup E_1 \cup E_2 \cup E_3\):
\begin{align*}
	E_0 & = \{\{a_{ij}, b_{ij}, u_{ij}\}\}_{i,j} \\
	E_1 & = \{\{a_{i(j+1)}, b_{ij}, w_{ij}\}\}_{i,j} \quad(\text{notar que si } j = m \text{, entonces } j+1 = 1) \\
	E_2 & = \{\{h_k, g_k, u_{ij}\}\}_{i,j,k} \cup \{\{h_k, g_k, w_{ij}\}\}_{i,j,k}\\
  E_3 & = \{\{s_j, t_j, v_{jr}\}\}_{j,r} \\
\end{align*}

\subsection*{Hay matching perfecto en H sii B es satisfacible}
\label{sec:orged3e6cd}
